In [1]:
import ibm_db_dbi
import pandas as pd

In [2]:
dsn_database = "BLUDB"            
dsn_hostname = "dashdb-txn-sbox-yp-dal09-03.services.dal.bluemix.net" 
dsn_port = "50000"                
dsn_protocol = "TCPIP"            
dsn_uid = "qfm90587"        
dsn_pwd = "822b+p41gdsx97ps"

In [3]:
dsn = (
    "DATABASE={0};"
    "HOSTNAME={1};"
    "PORT={2};"
    "PROTOCOL={3};"
    "UID={4};"
    "PWD={5};").format(dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd)
conn = ibm_db_dbi.connect(dsn, "", "")

In [8]:
sql = '''SELECT employee_id, first_name, hire_date, YEAR(NOW()) - YEAR(hire_date) AS tham_nien
    FROM employees
    ORDER BY tham_nien DESC;'''
df = pd.read_sql(sql, conn)

In [9]:
df.head()

   EMPLOYEE_ID FIRST_NAME  HIRE_DATE  THAM_NIEN
0          102        Lex 2001-01-13         19
1          108      Nancy 2002-08-17         18
2          109     Daniel 2002-08-16         18
3          114        Den 2002-12-07         18
4          203      Susan 2002-06-07         18

In [10]:
df.tail()

     EMPLOYEE_ID FIRST_NAME  HIRE_DATE  THAM_NIEN
102          167       Amit 2008-04-21         12
103          173    Sundita 2008-04-21         12
104          179    Charles 2008-01-04         12
105          183     Girard 2008-02-03         12
106          199    Douglas 2008-01-13         12